TravelGood/test/createNewItineraryTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trav="travelgood.ws">
  <soapenv:Body>
    <trav:createNewItinerary>
      <part1>name goes here</part1>
    </trav:createNewItinerary>
  </soapenv:Body>
</soapenv:Envelope>